package basic

/*
基础架构：一条SQL查询语句是如何执行的？

MySQL 基本架构
	Server 层
	存储引擎层
Server 层
	连接器、查询缓存、分析器、优化器、执行器等
	涵盖 MySQL 的大多数核心服务功能，以及所有的内置函数（如日期、时间、数学和加密函数等）
	所有跨存储引擎的功能都在这一层实现，比如存储过程、触发器、视图等
存储引擎层
	负责数据的存储和提取
	架构模式是插件式的，支持 InnoDB、MyISAM、Memory 等多个存储引擎
		现在最常用的存储引擎是 InnoDB，它从 MySQL 5.5.5 版本开始成为了默认存储引擎
		执行 create table 建表的时候，如果不指定引擎类型，默认使用的就是 InnoDB
		在 create table 语句中使用 engine=memory，来指定使用内存引擎创建表
	不同的存储引擎共用一个Server 层，也就是从连接器到执行器的部分
MySQL 的逻辑架构图
	01.MySQL逻辑架构图.jpg

示例
	mysql> select * from T where ID=10；
连接器
	连接器负责跟客户端建立连接、获取权限、维持和管理连接
	链接命令：mysql -h$ip -P$port -u$user -p
		mysql -h localhost -P 3306 -u root -p
		如果用户名或密码不对，你就会收到一个"Access denied for user"的错误，然后客户端程序结束执行
	权限
		如果用户名密码认证通过，连接器会到权限表里面查出你拥有的权限。之后，这个连接里面的权限判断逻辑，都将依赖于此时读到的权限
		一个用户成功建立连接后，即使你用管理员账号对这个用户的权限做了修改，也不会影响已经存在连接的权限
			修改完成后，只有再新建的连接才会使用新的权限设置
	空闲连接
		show processlist;
			Sleep
	自动断开
		客户端如果太长时间没动静，连接器就会自动将它断开。这个时间是由参数 wait_timeout 控制的，默认值是 8 小时
		此时，客户端再次发送请求的话，就会收到一个错误提醒： Lost connection to MySQL server during query
		如果你要继续，就需要重连，然后再执行请求了
	长连接
		连接成功后，如果客户端持续有请求，则一直使用同一个连接
		建立连接的过程通常是比较复杂的，所以在使用中要尽量减少建立连接的动作，也就是尽量使用长连接
	短连接
		每次执行完很少的几次查询就断开连接，下次查询再重新建立一个
	长连接 & OOM
		全部使用长连接后，你可能会发现，有些时候 MySQL 占用内存涨得特别快，这是因为 MySQL 在执行过程中临时使用的内存是管理在连接对象里面的
		这些资源会在连接断开的时候才释放
		所以如果长连接累积下来，可能导致内存占用太大，被系统强行杀掉（OOM），从现象看就是 MySQL 异常重启了
	解决方案：参考两种
		1.定期断开长连接
			使用一段时间，或者程序里面判断执行过一个占用内存的大查询后，断开连接，之后要查询再重连
		2.mysql_reset_connection	// TODO 怎么执行？
			如果你用的是 MySQL 5.7 或更新版本，可以在每次执行一个比较大的操作后，通过执行 mysql_reset_connection 来重新初始化连接资源
			这个过程不需要重连和重新做权限验证，但是会将连接恢复到刚刚创建完时的状态
查询缓存
	缓存逻辑
		MySQL 拿到一个查询请求后，会先到查询缓存看看，之前是不是执行过这条语句
		之前执行过的语句及其结果可能会以 key-value 对的形式，被直接缓存在内存中。key 是查询的语句，value 是查询的结果
		1.如果你的查询能够直接在这个缓存中找到 key，那么这个 value 就会被直接返回给客户端
		2.如果语句不在查询缓存中，就会继续后面的执行阶段。执行完成后，执行结果会被存入查询缓存中
	大多数情况下建议不要使用查询缓存，为什么呢？
		因为查询缓存往往弊大于利
		动态表
			查询缓存的失效非常频繁，只要有对一个表的更新，这个表上所有的查询缓存都会被清空
			因此很可能你费劲地把结果存起来，还没使用呢，就被一个更新全清空了
			对于更新压力大的数据库来说，查询缓存的命中率会非常低
		静态表：使用查询缓存
			业务有一张静态表，很长时间才会更新一次。比如，一个系统配置表，那这张表上的查询才适合使用查询缓存。
		query_cache_type：MySQL 也提供了这种“按需使用”的方式	// TODO
			将参数 query_cache_type 设置成 DEMAND，这样对于默认的 SQL 语句都不使用查询缓存
			而对于你确定要使用查询缓存的语句，可以用 SQL_CACHE 显式指定，像下面这个语句一样：
				mysql> select SQL_CACHE * from T where ID=10；
	MySQL 8.0
		MySQL 8.0 版本直接将查询缓存的整块功能删掉了，也就是说 8.0 开始彻底没有这个功能了
分析器：要做什么
	“词法分析”：mysql> select * from T where ID=10；
		select：查询语句
		T：表名T
		ID：列ID
	“语法分析”：
		如果你的语句不对，就会收到“You have an error in your SQL syntax”的错误提醒
		一般语法错误会提示第一个出现错误的位置，所以你要关注的是紧接“use near”的内容
		比如：
			mysql> elect * from t where ID=1;
			ERROR 1064 (42000): You have an error in your SQL syntax;
				check the manual that corresponds to your MySQL server version for the right syntax to use near 'elect * from t where ID=1' at line 1
优化器：该怎么做
	优化器是在表里面有多个索引的时候，决定使用哪个索引
	或者在一个语句有多表关联（join）的时候，决定各个表的连接顺序。比如你执行下面这样的语句，这个语句是执行两个表的 join：
		比如：mysql> select * from t1 join t2 using(ID) where t1.c=10 and t2.d=20;
			既可以先从表 t1 里面取出 c=10 的记录的 ID 值，再根据 ID 值关联到表 t2，再判断 t2里面 d 的值是否等于 20
			也可以先从表 t2 里面取出 d=20 的记录的 ID 值，再根据 ID 值关联到 t1，再判断 t1 里面 c 的值是否等于 10
		这两种执行方法的逻辑结果是一样的，但是执行的效率会有不同，而优化器的作用就是决定选择使用哪一个方案
	优化器阶段完成后，这个语句的执行方案就确定下来了
执行器
	没有权限
		先判断一下你对这个表 T 有没有执行查询的权限，如果没有，就会返回没有权限的错误
		在工程实现上，如果命中查询缓存，会在查询缓存返回结果的时候，做权限验证。查询也会在优化器之前调用 precheck 验证权限
			比如：
				mysql> select * from T where ID=10;
				ERROR 1142 (42000): SELECT command denied to user 'b'@'localhost' for table 'T'
	有权限
		没有索引：比如表 T 中，ID 字段没有索引
			1.调用 InnoDB 引擎接口取这个表的第一行，判断 ID 值是不是 10，如果不是则跳过，如果是则将这行存在结果集中；
			2.调用引擎接口取“下一行”，重复相同的判断逻辑，直到取到这个表的最后一行。
			3.执行器将上述遍历过程中所有满足条件的行组成的记录集作为结果集返回给客户端
		有索引：执行的逻辑也差不多
			第一次调用的是“取满足条件的第一行”这个接口
			之后循环取“满足条件的下一行”这个接口，这些接口都是引擎中已经定义好的
	rows_examined
		在数据库的慢查询日志中看到一个 rows_examined 的字段，表示这个语句执行过程中扫描了多少行
		这个值就是在执行器每次调用引擎获取数据行的时候累加的。
		在有些场景下，执行器调用一次，在引擎内部则扫描了多行，因此引擎扫描行数跟 rows_examined 并不是完全相同的

思考
	如果表 T 中没有字段 k，而你执行了这个语句 select * from T where k=1, 那肯定是会报“不存在这个列”的错误： “Unknown column ‘k’ in ‘where clause’”
	你觉得这个错误是在我们上面提到的哪个阶段报出来的呢？
		分析器
		Oracle会在分析阶段判断语句是否正确，表是否存在，列是否存在等。MySQL也是这样
*/
